In [1]:
import pandas as pd
import numpy as np

In [2]:
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
%matplotlib inline

In [4]:
data =pd.read_csv('/Users/nanjie/Desktop/application_record.csv')
record = pd.read_csv('/Users/nanjie/Desktop/credit_record.csv')

In [7]:
data.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [8]:
record.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [10]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   MONTHS_BALANCE  1048575 non-null  int64
 2   STATUS          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [11]:
data.describe()

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
count,4.385570e+05,438557.000000,4.385570e+05,438557.000000,438557.000000,438557.0,438557.000000,438557.000000,438557.000000,438557.000000
mean,6.022176e+06,0.427390,1.875243e+05,-15997.904649,60563.675328,1.0,0.206133,0.287771,0.108207,2.194465
std,5.716370e+05,0.724882,1.100869e+05,4185.030007,138767.799647,0.0,0.404527,0.452724,0.310642,0.897207
min,5.008804e+06,0.000000,2.610000e+04,-25201.000000,-17531.000000,1.0,0.000000,0.000000,0.000000,1.000000
25%,5.609375e+06,0.000000,1.215000e+05,-19483.000000,-3103.000000,1.0,0.000000,0.000000,0.000000,2.000000
50%,6.047745e+06,0.000000,1.607805e+05,-15630.000000,-1467.000000,1.0,0.000000,0.000000,0.000000,2.000000
75%,6.456971e+06,1.000000,2.250000e+05,-12514.000000,-371.000000,1.0,0.000000,1.000000,0.000000,3.000000
max,7.999952e+06,19.000000,6.750000e+06,-7489.000000,365243.000000,1.0,1.000000,1.000000,1.000000,20.000000

In [12]:
record.describe()

                 ID  MONTHS_BALANCE
count  1.048575e+06    1.048575e+06
mean   5.068286e+06   -1.913700e+01
std    4.615058e+04    1.402350e+01
min    5.001711e+06   -6.000000e+01
25%    5.023644e+06   -2.900000e+01
50%    5.062104e+06   -1.700000e+01
75%    5.113856e+06   -7.000000e+00
max    5.150487e+06    0.000000e+00

In [13]:
data.columns

Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS'],
      dtype='object')

In [14]:
record.columns

Index(['ID', 'MONTHS_BALANCE', 'STATUS'], dtype='object')

In [ ]:
sns.pairplot(data)

In [1]:
'''
If x = "quintessential", then slice x and do 
the appropriate operations to obtain QuinTESSential.
'''
x = "quintessential"
Alist =x[0:1:1]
Blist=x[4:8:1]
Clist =x[1:4:1]
Dlist =x[8:14:1]
print(Alist.upper() + Clist +Blist.upper() +Dlist)

QuinTESSential

In [2]:
'''
Write a Python program to select an item randomly from a list.
'''
import random
item_list =['computer','phone','pen','cup']
print(random.choice(item_list))

computer

In [3]:
'''
: Consider listA = [12, 14, 16, 19, 20, 24]. 
1) To listA add 18 at index 3 
2) To the list that was obtained from #1, remove 19
3) To the list that was obtained from #2, extend [28, 30]
'''
listA =[12,14,16,19,20,24]
listA.insert(3,18)
print(listA)
listA.remove(19)
print(listA)
listA +=[28,30]
print(listA)

[12, 14, 16, 18, 19, 20, 24]
[12, 14, 16, 18, 20, 24]
[12, 14, 16, 18, 20, 24, 28, 30]

In [5]:
'''
B = [14, 21, 24, 27, 32]. 
1) Create a list that contains the multiples of 4 from B.
2) Create a list that contains the multiples of 3 and 6.
Use two methods (for and if loops,  list comprehension)
'''
import numpy as np
B =np.array([14,21,24,27,32])
listA = []
listB =[]
for i in B:
    if i % 4 == 0:
        listA.append(i)
    if (i % 3 == 0) & (i % 6 == 0):
        listB.append(i)
print(listA)
print(listB)
#method2: list comprehension
B =[14,21,24,27,32]
newListA =[x for x in B if x % 4 == 0]
newListB =[x for x in B if (x %3 == 0) & (x % 6 ==0)]
print(newListA)
print(newListB)

[24, 32]
[24]
[24, 32]
[24]

In [6]:
'''
: If tuple1 = (-4, -2, -1). Insert 5 at index 0 to tuple1.
Read the output message carefully. 
'''
n = 0
tuple1 = (-4, -2, -1)
tuple1 =tuple1[:n]+(5,)+tuple1[n:]
print(tuple1)

(5, -4, -2, -1)

In [7]:
'''
 Convert tuple1 = (-4, -2, -1, 1) to a list and perform the 
following operations:
1) To the list, change the value index 0 to -5.
2) To the list that was obtained in #1, pop the value at index 1.
3) To the list that was obtained from #2, append -3.
4) Convert the list that was obtained in #3 to a tuple.
'''
tuple1 = (-4, -2, -1, 1)
list1 = list(tuple1)
list1[0]=-5
print(list1)
list2 = list1.pop(1)
print(list1)
list1.append(-3)
print(list1)
tuple1 =tuple(list1)
print(tuple1)

[-5, -2, -1, 1]
[-5, -1, 1]
[-5, -1, 1, -3]
(-5, -1, 1, -3)

In [8]:
'''
 Define a dictionary with the following key value pairs:
'France': 1789, 'India': 1947, 'USA': 1776, 'Brazil': 1822
print the keys and values pair
'''
dictionary={'France': 1789, 'India': 1947, 'USA': 1776, 'Brazil': 1822}
for key,value in dictionary.items():
    print(key,value)

France 1789
India 1947
USA 1776
Brazil 1822

In [9]:
'''
listA = [2, 14, 16, 38]. Use dictionary comprehension to 
create a dictionary with item from listA as a key and its cube as a value.
'''
listA =[2,14,16,28]
listB =[]
for i in listA:
    listB.append(i ** 3)
#print(listB)
dictionary = dict(zip(listA,listB))
print(dictionary)

{2: 8, 14: 2744, 16: 4096, 28: 21952}

In [10]:
'''
Write a Python program to print out a set containing all the colors from color_list_1 which are not present in color_list_2.

Test Data:
color_list_1 = set(["White", "Black", "Red"])
color_list_2 = set(["Red", "Green"])
Expected Output :
{'Black', 'White'}
'''
color_list_1 = set(["White", "Black", "Red"])
color_list_2 = set(["Red", "Green"])
print(color_list_1 -color_list_2)

{'White', 'Black'}

In [11]:
'''
listB=['iron','copper','iron','aluminum','copper', 'iron'].
1) Create a set for listB. 
2) Create a dictionary with the item from the set as the key and its occurence 
in listB as the value.
'''
listB=['iron','copper','iron','aluminum','copper', 'iron']
setB =set(listB)
dict={}
for i in listB:
    dict[i] = dict.get(i,0)+ 1
print(dict)

{'iron': 3, 'copper': 2, 'aluminum': 1}

In [12]:
'''
: If listC = [-7, -11, -9, -7]. Use set comprehension 
to compute square of each item in listC.
'''
import numpy as np
listC = [-7, -11, -9, -7]
newSet={i**2 for i in listC}
print(newSet)

{81, 49, 121}